void Example() {
  /*--------------------------------------- คำสั่ง เคลื่อนที่แบบ PID IMU มุม 0 90 180 270 360 หมายเหตุ 0 และ 360 คือมุมเดียวกัน -------------------------------------------*/
  FF(200, 500);  //เดินหน้า ครบค่า encoder แล้วจะยังคงวิ่งต่อด้วย lowspeed จนกว่าเซ็นเซอร์หน้าคู่ในจะเจอเส้นและถอยหลังอัตโนมัติ (ความเร็ว,encoder)
  BB(200, 500);  //ถอยหลัง ครบค่า encoder แล้วจะยังคงวิ่งต่อด้วย lowspeed จนกว่าเซ็นเซอร์หน้าคู่ในจะเจอเส้นและถอยหลังอัตโนมัติ (ความเร็ว,encoder)

  FF(200, 500, 100);  //เดินหน้า ครบค่า encoder แล้วจะยังคงวิ่งต่อด้วย lowspeed จนกว่าเซ็นเซอร์หน้าคู่ในจะเจอเส้น ใส่ค่า encoder ถอยหลังกลับแบบระบุเอง (ความเร็ว,ระยะทาง,ระยะทางย้อนกลับ)
  BB(200, 500, 300);  //ถอยหลัง ครบค่า encoder แล้วจะยังคงวิ่งต่อด้วย lowspeed จนกว่าเซ็นเซอร์หน้าคู่ในจะเจอเส้น ใส่ค่า encoder ถอยหลังกลับแบบระบุเอง (ความเร็ว,ระยะทาง,ระยะทางย้อนกลับ)

  FFe(200, 500);  //เดินหน้าครบค่า encoder แล้วหยุด (ความเร็ว,encoder) < ค่าความเร็วจะลดลงแบบสมูทเมื่อเข้าใกล้ระยะทาง >
  BBe(200, 500);  //ถอยหลังครบค่า encoder แล้วหยุด (ความเร็ว,encoder) < ค่าความเร็วจะลดลงแบบสมูทเมื่อเข้าใกล้ระยะทาง >

  FFe(200, 500, 1);  //เดินหน้าครบค่า encoder แล้วหยุด (ความเร็ว,encoder,ค่า 1)  < ค่าความเร็วต่อเนื่อง >
  BBe(200, 500, 1);  //ถอยหลังครบค่า encoder แล้วหยุด (ความเร็ว,encoder,ค่า 1) < ค่าความเร็วต่อเนื่อง >

  FFt(200, 500);  //เดินหน้าด้วยเวลา ครบเวลาแล้วหยุด (ความเร็ว,เวลา)
  BBt(200, 500);  //ถอยหลังด้วยเวลา ครบเวลาแล้วหยุด (ความเร็ว,เวลา)

  //---------------------------------- ฟังก์ชั่นพิเศษ จูนระยะทางวิ่งแต่ละช่อง พร้อมคำสั่งเลี้ยว Spin และ Turn ---------------------------------//
  FSpin(2, -100, 'l');  //เดินหน้าใส่จำนวนช่องพร้อมเลือกหมุน (จำนวนช่องที่ต้องการเดิน , ระยะทางสามารถเพิ่มลดได้ , เลือกทิศทางให้หมุนไป 90 องศา)
  BSpin(3, 100, 'r');   //สามารถเข้าไปจูนระยะทางแต่ละ box ได้จากฟังก์ชั่นด้านใน 'l' = ซ้าย  'r' = ขวา  's' = หยุด
  FTurn(4, -200, 'l');
  BTurn(1, 50, 's');

  SetF();  //เซ็ตด้านหน้า ตั้งตรง ใช้กรณีหุ่นมีโอกาสเอียงให้ set ตัวใหม่เพื่อ รีเช็ตมุมไจโร (แน่ะนำใช้ Cal(); ดีกว่า)
  SetB();  //เซ็ตด้านหลัง ตั้งตรง ใช้กรณีหุ่นมีโอกาสเอียงให้ set ตัวใหม่เพื่อ รีเช็ตมุมไจโร (แน่ะนำใช้ Cal(); ดีกว่า)

  FTK(50, 800);  //คำสั่งเดินหน้าข้ามตะเกียบ (ความเร็ว , encoder) คำสั่งนี้จะตรวจจับการสั่นของ IMU แกน Y เพื่อข้ามให้พ้นตะเกียบ แน่ะนำ ช้าๆ ชัวร์ๆ (หากใช้ไม่ได้สามารถใช้คำสั่งวิ่งปกติข้ามได้)
  BTK(50, 800);  //คำสั่งเดินหน้าข้ามตะเกียบ (ความเร็ว , encoder) คำสั่งนี้จะตรวจจับการสั่นของ IMU แกน Y เพื่อข้ามให้พ้นตะเกียบ แน่ะนำ ช้าๆ ชัวร์ๆ (หากใช้ไม่ได้สามารถใช้คำสั่งวิ่งปกติข้ามได้)
 // MoveUltra(50, 2);  // วิ่งจนกว่าจะ เข้าใกล้ระยะเซ็นเซอร์อัลตร้า (Speed , cm)
  UpSlope();         // เดินหน้าขึ้นสพานถ้า ใช้ไม่ได้ใช้ FFe แทนได้
  DownSlope();       // เดินหน้าลงสพาน

  BUpSlope();    // ถอยหลังขึ้นสพาน ถ้าใช้ไม่ได้ใช้  BBe แทนได้
  BDownSlope();  //  ถอยหลังลงสพาน

  SpinL();  //หมุนซ้าย
  SpinR();  //หมุนขวา

  SpinL(1);  //หมุนซ้าย แบบ lowSpeed
  SpinR(1);  //หมุนขวา แบบ lowSpeed

  TurnR();   //โค้งเข้ามุมขวา
  TurnL();   //โค้งเข้ามุมซ้าย
  TurnBR();  //ถอยหลังโค้งเข้ามุมขวา
  TurnBL();  //ถอยหลังโค้งเข้ามุมซ้าย
  /*---------------------------------- คำสั่งชดเชยมุมเอียงเพื่อความง่ายในการกำหนดมุม IMU ใช้สั่งก่อนใช้คำสั่งถัดไป  --------------------------------------*/
  Cal(5);   // บวกค่ามุมจากเดิมเช่น ขณะนี้หุ่นยนต์อยู่มุม 180 องศา ถ้า Cal(5); มุมจะเท่ากับ +5 องศา เป็น 185 (หุ่นจะเอียงไปทางซ้ายเพื่อกลับเข้ามุม 180)
  Cal(-3);  // ลบค่ามุมจากเดิมเช่น ขณะนี้หุ่นยนต์อยู่มุม 180 องศา ถ้า Cal(-3);  มุมจะเท่ากับ -3 องศา เป็น 177 (หุ่นจะเอียงไปทางขวาเพื่อกลับเข้ามุม 180)

  /*----------------------------------------------------- คำสั่งทั่วไป --------------------------------------------------------------*/
  ST();  //สั่งหยุดพร้อมปริ้นค่า Sensor บนจอ กด SW1 เพื่อทำงานต่อ
  SW();  //คำสั่งรอการกดสวิตว์ SW1 พร้อมปริ้นค่า Sensor บนจอ กด SW1 เพื่อทำงาน

  ResetAngle_Z();  //สั่ง รีเช็ตค่ามุมปัจจุบันให้เป็น ค่าเริ่มต้นมุม 180 องศา (หุ่นยนต์ควรหยุดนิ่งก่อนรีเซ็ตค่าป้องกันการบันทึกค่าผิดพลาด)
  ResetAngle_Y();
  ResetAngle_X();

  /*------------------------------------- คำสั่ง Servo ควบคุม Servo ควรตั้งองศาให้พอดี ที่หน้า Servo.ino ใช้ Servo pin 5 ขึ้นไปเท่านั้น --------------------------------------*/
  Servo(1, 0);  //สั่ง Servo ch = 5 ตำแหน่ง 0 องศา
  Servo(2, 180);

  HanL('c');        //คำสั่ง มือจับซ้าย  'c' = Close (จับกระป๋อง) , 'o' = Open (อ้ามือ) , 'h' = Half(อ้ามือเพื่อให้กระป๋องไหลลงจากมือ) , 'H' = Half (อ้ามือกว้างกว่า h เพื่อวางประป๋องโดยป้องกันมือจับไปชนกับกระป๋องด้านข้าง)
  HanR('c');        //คำสั่ง มือจับขวา
  HanLR('c', 'c');  //คำสั่งควบคุมมือจับได้ 2 ตัวในบรรทัดเดียว

  ArmL('c');        //คำสั่งแขนซ้าย  'b' = (แขนไปที่ตำแหน่งด้านหลัง)  'c' = (ตำแหน่งแขนตั้งฉากกับชุดลิฟท์) 'g' = (ตำแหน่งมือจับพร้อมหยิบกระป๋อง Get) 'f' = (ตำแหน่งมือพร้อมแลกเปลี่ยนกระป๋องกึ่งกลาง)
  ArmR('c');        //คำสั่งแขนขวา //คำสั่งควบคุม Servoได้ 2 ตัวในบรรทัดเดียว
  ArmLR('f', 'f');  //คำสั่งควบคุมแขนได้ 2 ตัวในบรรทัดเดียว

  SwapLR();  //สลับกระป๋อง ซ้าย ไป ขวา
  SwapRL();  //สลับกระป๋อง ขวา ไป ซ้าย

  DropL();   //วางซ้ายฝั่งเดียว
  DropR();   //วางขวาฝั่งเดียว
  DropLR();  //วางซ้ายและขวา

  //LoadCanLR();  //โหลดกระป๋องไปเก็บด้านหลัง ซ้าย ขวา
  //LoadCanL();   //โหลดกระป๋องไปเก็บด้านหลัง ซ้าย
 // LoadCanR();   //โหลดกระป๋องไปเก็บด้านหลัง ขวา

 // GetLoadLR();  //หยิบกระป๋องที่โหลดอยู่ด้านหลัง ซ้าย ขวา
 //// GetLoadR();   //หยิบกระป๋องที่โหลดอยู่ด้านหลัง ขวา
 // GetLoadL();   //หยิบกระป๋องที่โหลดอยู่ด้านหลัง ซ้าย

  //---------------------------------- ลิฟท์ ค่า encoder  คือ 0 - 5000 ไม่ควรสั่ง 5000 ควรใช้ไม่เกิน 4900 เพื่อป้องกันลิฟท์หลุด -----------------------------------------------//
  MoveLift(800);    //สั่งก่อนเริ่มเคลื่อนที่ เมื่อหุ่นยนต์เคลื่อนที่จะยกลิฟท์ไปพร้อมกัน
  Lift(500);        //หุ่นยนต์จะหยุดและยกลิฟท์ตามค่า encoder ที่สั่ง
  GetCan(3, 1300,'l');  //คำสั่งเข้าไปหยิบกระป๋อง (ระยะห่าง Ultrasonic กับแท่น , ยกลิฟท์ขึ้น 0-5000)
  GetCan2(5, 0);    //คำสั่งเข้าไปหยิบกระป๋อง เหมาะสำหรับกระป๋องไม่มีแท่น ใช้ Ultrasonic เช็คระยะกระป๋องโดยประมาณ 5cm
  SetCan();         //คำสั่งตั้งกระป๋องมือจับที่พื้นใหม่อีกครั้งลิทฟ์จะลงมาที่ตำแหน่ง 0 และเริ่มจับกระป๋องใหม่ ใช้หลังหยิบเสร็จและถอยออกจากแท่นแล้ว
  SetAH();          //เก็บแขน ซ้ายขวาไปตำแหน่ง 'g' และ มือซ้ายขวา 'c'

 // CanStand('G', 'R');  // คำสั่งสลับฝั่งแท่นวาง สั่งก่อนเข้าไปวางกรณีรู้ว่าแท่นสลับ
  //CanStand('R', 'G');  // คำสั่งสลับฝั่งแท่นวาง สั่งก่อนเข้าไปวางกรณีรู้ว่าแท่นสลับ

  DropCan(3, 1500);  //คำสั่งเข้าไปวางกระป๋องที่แท่น (ระยะห่าง Ultrasonic กับแท่น , ยกลิฟท์ขึ้น 0-4000)  **การวางกระป่องจะใช้คำสั่ง DropCan2 เพื่อเลือกวางอีกต่อไป


  SetAH();
  SetLR();

  /*----------------------------------------------------- คำสั่ง Motor เมื่อต้องการทดสอบ -----------------------------------------*/
  Motor1(150);   //สั่งมอเตอร์ 1 (หน้าซ้าย)
  Motor2(-150);  //สั่งมอเตอร์ 2 หมุนถอยหลัง (หน้าขวา)
  Motor3(150);   //สั่งมอเตอร์ 3 (หลังซ้าย)
  Motor4(-150);  //สั่งมอเตอร์ 4 หมุนถอยหลัง (หลังขวา)

  Motor1('s');  //สั่งมอเตอร์ 1 เบรค (หน้าซ้าย)
  Motor2('s');  //สั่งมอเตอร์ 2 เบรค (หน้าขวา)
  Motor3('s');  //สั่งมอเตอร์ 3 เบรค (หลังซ้าย)
  Motor4('s');  //สั่งมอเตอร์ 4 เบรค (หลังขวา)

  MT(150, 150);      //สั่งมอเตอร์ ซ้ายขวา เป็นคู่  (คู่ซ้ายหน้าหลัง , คู่ขวาหน้าหลัง)
  MT(50, 50, 1500);  //สั่งมอเตอร์ ซ้ายขวา เป็นคู่  (คู่ซ้ายหน้าหลัง , คู่ขวาหน้าหลัง , delay ms)
  delay(100);        //หน่วงเวลา 1000ms = 1 วินาที

  MotorStop();     //สั่งหยุดโดยจ่าย logic 0,0
  MotorShot(255);  //สั่งหยุดเบรคโดยจ่าย logic 1,1 ความแรงในการเบรค 0-255
  Motor5('s');     //สั่ง Lift หยุดหมุนป้องกันการหมุนเกินระยะ
}